<a href="https://colab.research.google.com/github/helianakhjavani/Recommended-system/blob/main/2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

**Pandas series**

In [ ]:
data = np.array(['a', 'b', 'c', 'd'])
pd.Series(data)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
pd.Series(data, index = [1,2,3,4])

1    a
2    b
3    c
4    d
dtype: object

In [ ]:
pd.Series(data, index = [j for j in range(1,5)])

1    a
2    b
3    c
4    d
dtype: object

NAN

In [ ]:
np.nan

nan

In [ ]:
s= pd.Series([1, 3, 5, np.nan, 10 , 5, 8])
s

0     1.0
1     3.0
2     5.0
3     NaN
4    10.0
5     5.0
6     8.0
dtype: float64

In [ ]:
data1 = {"a" : 0,"b" : 1, "c" : 2, "d" : 3}
data1

{'a': 0, 'b': 1, 'c': 2, 'd': 3}

In [ ]:
s1 = pd.Series(data1)
s1

a    0
b    1
c    2
d    3
dtype: int64

In [ ]:
s[3]

nan

In [ ]:
s[1:4]

1    3.0
2    5.0
3    NaN
dtype: float64

In [ ]:
s[-3:]

4    10.0
5     5.0
6     8.0
dtype: float64

In [ ]:
s1[2]

2

In [ ]:
s1['b']

1

**Pandas Dataframe**

In [ ]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
input = {'FistName' : ["Sajjad", "Ali", "Mohsen"], 'LastName' : ["Heydari", "Jahani", "Royati"]}
index = [1,2,3]

df1 = pd.DataFrame(input, index)
df1

  FistName LastName
1   Sajjad  Heydari
2      Ali   Jahani
3   Mohsen   Royati

In [ ]:
data1 = [["sajjad", "Heydari"],["Ali", "Jahani"], ["Mohsen", "Royati"]]
df2 = pd.DataFrame(data1, index = [1,2,3], columns = ["FirstName", "LastName"])
df2

  FirstName LastName
1    sajjad  Heydari
2       Ali   Jahani
3    Mohsen   Royati

In [2]:
#example
data2 = [[1,2,np.nan], [5,10,20]]
df3 = pd.DataFrame(data2, columns = ["A", "B", "C"])
df3

   A   B     C
0  1   2   NaN
1  5  10  20.0

In [3]:
data3 = {"ONE" : pd.Series([1,2,3], index = ["A", "B", "C"])  , "TWO" : pd.Series([1,2,3,4], index = ["A", "B", "C" , "D"])}
df4 = pd.DataFrame(data3)
df4

   ONE  TWO
A  1.0    1
B  2.0    2
C  3.0    3
D  NaN    4

In [4]:
df4["THREE"] = pd.Series([10,20,30], index = ["A", "B", "C"]) 
df4

   ONE  TWO  THREE
A  1.0    1   10.0
B  2.0    2   20.0
C  3.0    3   30.0
D  NaN    4    NaN

In [5]:
df4["FOUR"] = df4["ONE"] + df4["TWO"] + df4["THREE"]
df4

   ONE  TWO  THREE  FOUR
A  1.0    1   10.0  12.0
B  2.0    2   20.0  24.0
C  3.0    3   30.0  36.0
D  NaN    4    NaN   NaN

In [6]:
df4.pop("FOUR")

A    12.0
B    24.0
C    36.0
D     NaN
Name: FOUR, dtype: float64

In [7]:
df4

   ONE  TWO  THREE
A  1.0    1   10.0
B  2.0    2   20.0
C  3.0    3   30.0
D  NaN    4    NaN

In [8]:
df5 = df4.drop("ONE", axis = 1)  #axis 1 for columns

In [9]:
df5

   TWO  THREE
A    1   10.0
B    2   20.0
C    3   30.0
D    4    NaN

In [10]:
df6 = df5.drop("D", axis = 0)
df6

   TWO  THREE
A    1   10.0
B    2   20.0
C    3   30.0

loc and iloc method

In [13]:
df6.loc["B"]

TWO       2.0
THREE    20.0
Name: B, dtype: float64

In [14]:
df6.iloc[1]

TWO       2.0
THREE    20.0
Name: B, dtype: float64

In [15]:
df6.iloc[[0,1],1]

A    10.0
B    20.0
Name: THREE, dtype: float64

In [17]:
df6.iloc[[0,1], :]

   TWO  THREE
A    1   10.0
B    2   20.0

**Random Variables**

In [18]:
np.random.rand(10,3)

array([[0.52285649, 0.512575  , 0.03896388],
       [0.5577985 , 0.2784439 , 0.9450221 ],
       [0.68179817, 0.01255583, 0.67827447],
       [0.49453911, 0.28202122, 0.43930584],
       [0.16931153, 0.39785949, 0.24425143],
       [0.8714268 , 0.22052402, 0.38757914],
       [0.4134984 , 0.30614514, 0.90084171],
       [0.56935799, 0.23283815, 0.67704273],
       [0.82615125, 0.91952926, 0.64604394],
       [0.08339809, 0.52022041, 0.17188486]])

In [20]:
x = pd.DataFrame(np.random.rand(10,4), columns = ["A", "B", "C", "D"])

**head, tail methods**

In [21]:
x.tail(3)

          A         B         C         D
7  0.945976  0.061248  0.695420  0.881938
8  0.569173  0.003710  0.701944  0.698622
9  0.513614  0.940264  0.830476  0.056106

In [22]:
x.head(3)

          A         B         C         D
0  0.565291  0.873847  0.441848  0.639440
1  0.396953  0.382484  0.932281  0.395385
2  0.285848  0.195642  0.916567  0.682813

In [23]:
np.random.randint(2,20, 6)

array([ 8, 10,  5, 13, 11, 13])

In [29]:
y = pd.DataFrame(np.random.normal(0,1,100).reshape(-1,4),columns= ["A", "B", "C","D"])

In [30]:
z = x.append(y)

In [31]:
z

           A         B         C         D
0   0.565291  0.873847  0.441848  0.639440
1   0.396953  0.382484  0.932281  0.395385
2   0.285848  0.195642  0.916567  0.682813
3   0.607004  0.624340  0.396269  0.761224
4   0.244978  0.150673  0.711655  0.445163
5   0.345532  0.047319  0.240676  0.583795
6   0.082839  0.651039  0.148312  0.434982
7   0.945976  0.061248  0.695420  0.881938
8   0.569173  0.003710  0.701944  0.698622
9   0.513614  0.940264  0.830476  0.056106
0   1.405567 -0.199265  0.225549  0.772742
1   0.432395  0.026801  0.515889  1.345806
2   0.771112 -0.407737 -0.123296  0.079259
3   0.264656 -1.169526 -2.275143 -1.097321
4   2.819402  0.155269 -1.361027  0.473519
5  -0.686876  0.625676 -1.764453  0.083031
6   1.238437 -0.010084  0.123722  0.268119
7  -0.209937  0.292951  0.477892 -1.504653
8   3.326699 -0.339857  1.277077  0.580716
9  -0.072743 -0.433490  1.185461  0.570863
10  0.061520  1.017056  0.796171  0.492083
11 -0.077643  2.311871  0.389744  1.434519
12  0.180382 -0.774871  0.127263 -0.135952
13  0.892219 -0.375305  0.650459 -0.173627
14 -0.308911  1.774794 -0.334692 -0.643828
15  0.281982  1.187484  0.030119  0.346039
16  0.497272 -0.714458  0.014571 -0.544633
17  0.775372  0.304512  1.459416 -0.728123
18 -0.099766  0.600245 -0.649985 -0.156555
19 -1.740443  0.188672 -1.816866 -0.449209
20  2.020460 -0.605277 -1.113537  0.137134
21 -0.591405  0.136451  0.331375 -1.453981
22  0.046747  0.225399  1.015976 -1.550764
23 -0.101886  0.980333  0.784316 -0.225880
24  0.706086  0.325771 -1.224483 -0.279676

In [43]:

z.reset_index(drop=True)

           A         B         C         D
0   0.565291  0.873847  0.441848  0.639440
1   0.396953  0.382484  0.932281  0.395385
2   0.285848  0.195642  0.916567  0.682813
3   0.607004  0.624340  0.396269  0.761224
4   0.244978  0.150673  0.711655  0.445163
5   0.345532  0.047319  0.240676  0.583795
6   0.082839  0.651039  0.148312  0.434982
7   0.945976  0.061248  0.695420  0.881938
8   0.569173  0.003710  0.701944  0.698622
9   0.513614  0.940264  0.830476  0.056106
10  1.405567 -0.199265  0.225549  0.772742
11  0.432395  0.026801  0.515889  1.345806
12  0.771112 -0.407737 -0.123296  0.079259
13  0.264656 -1.169526 -2.275143 -1.097321
14  2.819402  0.155269 -1.361027  0.473519
15 -0.686876  0.625676 -1.764453  0.083031
16  1.238437 -0.010084  0.123722  0.268119
17 -0.209937  0.292951  0.477892 -1.504653
18  3.326699 -0.339857  1.277077  0.580716
19 -0.072743 -0.433490  1.185461  0.570863
20  0.061520  1.017056  0.796171  0.492083
21 -0.077643  2.311871  0.389744  1.434519
22  0.180382 -0.774871  0.127263 -0.135952
23  0.892219 -0.375305  0.650459 -0.173627
24 -0.308911  1.774794 -0.334692 -0.643828
25  0.281982  1.187484  0.030119  0.346039
26  0.497272 -0.714458  0.014571 -0.544633
27  0.775372  0.304512  1.459416 -0.728123
28 -0.099766  0.600245 -0.649985 -0.156555
29 -1.740443  0.188672 -1.816866 -0.449209
30  2.020460 -0.605277 -1.113537  0.137134
31 -0.591405  0.136451  0.331375 -1.453981
32  0.046747  0.225399  1.015976 -1.550764
33 -0.101886  0.980333  0.784316 -0.225880
34  0.706086  0.325771 -1.224483 -0.279676

**Multi index DataFrame**

In [36]:
mulindex = pd.MultiIndex(levels = [["Grade1", "Grade2"],["X", "Y"]], codes =[[0,1,0,1],[0,1,1,0]] )

In [39]:
data = {"Student 1" : [98,83,89,75], "Student 2": [89,97,78,79]}
df1 = pd.DataFrame(data, mulindex)

In [40]:
df1

          Student 1  Student 2
Grade1 X         98         89
Grade2 Y         83         97
Grade1 Y         89         78
Grade2 X         75         79